const MOCK_PRODUCTS = [
 

  {
    name: "LUSTRO",
    nameAr: "غرفة نوم لاسترو",
    category: "غرف نوم",
    price: 17800,
    description:
      "غرفة نوم بتصميم عصري يجمع بين الأناقة والمتانة، تم تنفيذها بعناية لتوفير أعلى مستوى من الجودة والراحة. مناسبة للمساحات الصغيرة والمتوسطة والكبيرة.",
    materials: [
      "خشب زان احمر",
      "مفصلات سوفت كلوز",
      "مشطيب مقاوم للخدش والرطوبة",
      "اكسسواات متينة لضمان العمر اطول",
    ],
    images: [
      "/pics/25-lus/25.1.jpeg",
      "/pics/25-lus/25.2.jpeg",
      "/pics/25-lus/25.3.jpeg",
      "/pics/25-lus/25.4.jpeg",
    ],
    badge: "الأفضل",
    inStock: true,
    details: [{ label: "العناصر", value: "دولاب, كومود, سرير دبل" }],
  },
  {
    name: "LUNARA",
    nameAr: "غرفة نوم لونارا",
    category: "غرف نوم",
    price: 17800,
    description:
      "غرفة نوم بتصميم عصري يجمع بين الأناقة والمتانة، تم تنفيذها بعناية لتوفير أعلى مستوى من الجودة والراحة. مناسبة للمساحات الصغيرة والمتوسطة والكبيرة.",
    materials: [
      "خشب زان احمر",
      "مفصلات سوفت كلوز",
      "مشطيب مقاوم للخدش والرطوبة",
      "اكسسواات متينة لضمان العمر اطول",
    ],
    images: [
      "/pics/28-lunara/28.4.jpeg",
      "/pics/28-lunara/28.2.jpeg",
      "/pics/28-lunara/28.3.jpeg",
      "/pics/28-lunara/28.1.jpeg",
    ],
    badge: "الأفضل",
    inStock: true,
    details: [{ label: "العناصر", value: "دولاب, كومود, سرير دبل" }],
  },
  {
    name: "Royal Line",
    nameAr: "غرفة رويال لاين",
    category: "غرف نوم",
    price: 25000,
    description:
      "غرفة نوم بتصميم عصري يجمع بين الأناقة والمتانة، تم تنفيذها بعناية لتوفير أعلى مستوى من الجودة والراحة. مناسبة للمساحات الصغيرة والمتوسطة والكبيرة.",
    materials: [
      "خشب زان احمر",
      "مفصلات سوفت كلوز",
      "مشطيب مقاوم للخدش والرطوبة",
      "اكسسواات متينة لضمان العمر اطول",
    ],
    images: [
      "/pics/20-line/20.2.jpeg",
      "/pics/20-line/20.1.jpeg",
      "/pics/20-line/20.3.jpeg",
      "/pics/20-line/20.4.jpeg",
    ],
    badge: "جديد",
    inStock: true,
    details: [{ label: "العناصر", value: "دولاب, كومود, سرير دبل" }],
  },
  {
    name: "Vision",
    nameAr: "غرفة فيجن",
    category: "غرف نوم",
    price: 14000,
    description:
      "غرفة نوم بتصميم عصري يجمع بين الأناقة والمتانة، تم تنفيذها بعناية لتوفير أعلى مستوى من الجودة والراحة. مناسبة للمساحات الصغيرة والمتوسطة والكبيرة.",
    materials: [
      "خشب زان احمر",
      "مفصلات سوفت كلوز",
      "مشطيب مقاوم للخدش والرطوبة",
      "اكسسواات متينة لضمان العمر اطول",
    ],
    images: ["./pics/2-vis/2.1.jpeg", "./pics/2-vis/2.2.jpeg", "./pics/2-vis/2.3.jpeg"],
    badge: "جديد",
    inStock: true,
    details: [{ label: "العناصر", value: "دولاب, كومود, سرير دبل" }],
  },
  {
    name: "Imperial Majesty",
    nameAr: "غرفة إمبريال ماجيستي",
    category: "غرف نوم",
    price: 28000,
    description:
      "غرفة نوم بتصميم عصري يجمع بين الأناقة والمتانة، تم تنفيذها بعناية لتوفير أعلى مستوى من الجودة والراحة. مناسبة للمساحات الصغيرة والمتوسطة والكبيرة.",
    materials: [
      "خشب زان احمر",
      "مفصلات سوفت كلوز",
      "مشطيب مقاوم للخدش والرطوبة",
      "اكسسواات متينة لضمان العمر اطول",
    ],
    images: [
      "./pics/14-imp/14.1.jpeg",
      "./pics/14-imp/14.2.jpeg",
      "./pics/14-imp/14.3.jpeg",
      "./pics/14-imp/14.4.jpeg",
    ],
    badge: "الأفضل",
    inStock: true,
    details: [{ label: "العناصر", value: "دولاب, كومود, سرير دبل" }],
  },
  {
    name: "Royal Dressing",
    nameAr: "دريسنج رويال",
    category: "دريسنج",
    price: 28000,
    description:
      "غرفة نوم بتصميم عصري يجمع بين الأناقة والمتانة، تم تنفيذها بعناية لتوفير أعلى مستوى من الجودة والراحة.",
    materials: [
      "خشب زان احمر",
      "مفصلات سوفت كلوز",
      "مشطيب مقاوم للخدش والرطوبة",
      "اكسسواات متينة لضمان العمر اطول",
    ],
    images: [
      "./pics/26-dres/26.4.jpeg",
      "./pics/26-dres/26.2.jpeg",
      "./pics/26-dres/26.3.jpeg",
      "./pics/26-dres/26.1.jpeg",
    ],
    badge: "الأفضل",
    inStock: true,
    details: [{ label: "العناصر", value: "دولاب, كومود, سرير دبل" }],
  },
  {
    name: "Prestige Room",
    nameAr: "غرفة بريستيج",
    category: "غرف نوم",
    price: 32250,
    description:
      "غرفة نوم بتصميم عصري يجمع بين الأناقة والمتانة، تم تنفيذها بعناية لتوفير أعلى مستوى من الجودة والراحة.",
    materials: [
      "خشب زان احمر",
      "مفصلات سوفت كلوز",
      "مشطيب مقاوم للخدش والرطوبة",
      "اكسسواات متينة لضمان العمر اطول",
    ],
    images: [
      "/pics/0-pres/0.1.jpeg",
      "/pics/0-pres/0.2.jpeg",
      "/pics/0-pres/0.3.jpeg",
    ],
    badge: "الأفضل",
    inStock: true,
    details: [{ label: "العناصر", value: "دولاب, كومود, سرير دبل" }],
  },
  {
    name: "Granada",
    nameAr: "غرفة غرناطة",
    category: "غرف نوم",
    price: 13500,
    description:
      "غرفة نوم بتصميم عصري يجمع بين الأناقة والمتانة، تم تنفيذها بعناية لتوفير أعلى مستوى من الجودة والراحة.",
    materials: [
      "خشب زان احمر",
      "مفصلات سوفت كلوز",
      "مشطيب مقاوم للخدش والرطوبة",
      "اكسسواات متينة لضمان العمر اطول",
    ],
    images: [
      "/pics/1-gar/1.1.jpeg",
      "/pics/1-gar/1.2.jpeg",
      "/pics/1-gar/1.3.jpeg",
      "/pics/1-gar/1.4.jpeg",
      "/pics/1-gar/1.5.jpeg",
      "/pics/1-gar/1.6.jpeg",
    ],
    badge: "جديد",
    inStock: true,
    details: [{ label: "العناصر", value: "دولاب, كومود, سرير دبل" }],
  },
  {
    name: "Valencia",
    nameAr: "غرفة فالنسيا",
    category: "غرف نوم",
    price: 20300,
    description:
      "غرفة نوم بتصميم عصري يجمع بين الأناقة والمتانة، تم تنفيذها بعناية لتوفير أعلى مستوى من الجودة والراحة.",
    materials: [
      "خشب زان احمر",
      "مفصلات سوفت كلوز",
      "مشطيب مقاوم للخدش والرطوبة",
      "اكسسواات متينة لضمان العمر اطول",
    ],
    images: [
      "./pics/21-val/21.3.jpeg",
      "./pics/21-val/21.2.jpeg",
      "./pics/21-val/21.1.jpeg",
    ],
    badge: "الأفضل",
    inStock: true,
    details: [{ label: "العناصر", value: "دولاب, كومود, سرير دبل" }],
  },
  {
    name: "Castello Prime",
    nameAr: "كاسييلو برايم",
    category: "غرفة نوم",
    price: 49000,
    description:
      "غرفة نوم بتصميم عصري يجمع بين الأناقة والمتانة، تم تنفيذها بعناية لتوفير أعلى مستوى من الجودة والراحة.",
    materials: [
      "خشب زان احمر",
      "مفصلات سوفت كلوز",
      "مشطيب مقاوم للخدش والرطوبة",
      "اكسسواات متينة لضمان العمر اطول",
    ],
    images: [
      "./pics/19-prime/19.1.jpeg",
      "./pics/19-prime/19.2.jpeg",
      "./pics/19-prime/19.3.jpeg",
      "./pics/19-prime/19.4.jpeg",
    ],
    badge: "جديد",
    inStock: true,
    details: [{ label: "العناصر", value: "دولاب, كومود, سرير دبل" }],
  },
  {
    name: "Mirror Pro",
    nameAr: "مرآة برو",
    category: "مرايا",
    price: 15600,
    description:
      "غرفة نوم بتصميم عصري يجمع بين الأناقة والمتانة، تم تنفيذها بعناية لتوفير أعلى مستوى من الجودة والراحة.",
    materials: [
      "خشب زان احمر",
      "مفصلات سوفت كلوز",
      "مشطيب مقاوم للخدش والرطوبة",
      "اكسسواات متينة لضمان العمر اطول",
    ],
    images: [
      "./pics/27-mirror/27.1.jpeg",
      "./pics/27-mirror/27.2.jpeg",
      "./pics/27-mirror/27.3.jpeg",
      "./pics/27-mirror/27.4.jpeg",
    ],
    badge: "جديد",
    inStock: true,
    details: [{ label: "العناصر", value: "دولاب, كومود, سرير دبل" }],
  },
  {
    name: "Crown Dressing",
    nameAr: "دريسنج كراون",
    category: "دريسنج",
    price: 29200,
    description:
      "غرفة نوم بتصميم عصري يجمع بين الأناقة والمتانة، تم تنفيذها بعناية لتوفير أعلى مستوى من الجودة والراحة.",
    materials: [
      "خشب زان احمر",
      "مفصلات سوفت كلوز",
      "مشطيب مقاوم للخدش والرطوبة",
      "اكسسواات متينة لضمان العمر اطول",
    ],
    images: [
      "./pics/24-cro/24.1.jpeg",
      "./pics/24-cro/24.2.jpeg",
      "./pics/24-cro/24.3.jpeg",
    ],
    badge: "الأفضل",
    inStock: true,
    details: [
      {
        label: "ملاحظات",
        value:
          "يتم تنفيذ الغرفة بالكامل حسب رغبة العميل من حيث المقاسات والألوان، مع إمكانية التعديل قبل التنفيذ",
      },
    ],
  },
  {
    name: "Serena Beige",
    nameAr: "غرفة إيليت",
    category: "غرف نوم",
    price: 48500,
    description:
      "غرفة نوم بتصميم عصري يجمع بين الأناقة والمتانة، تم تنفيذها بعناية لتوفير أعلى مستوى من الجودة والراحة.",
    materials: [
      "خشب زان احمر",
      "مفصلات سوفت كلوز",
      "مشطيب مقاوم للخدش والرطوبة",
      "اكسسواات متينة لضمان العمر اطول",
    ],
    images: [
      
      "/pics/17-ser/17.1.jpeg",
      "/pics/17-ser/17.2.jpeg",
      "/pics/17-ser/17.3.jpeg",
    ],
    badge: "جديد",
    inStock: true,
    details: [{ label: "العناصر", value: "دولاب, كومود, سرير دبل" }],
  },
  {
    name: "Elite Room",
    nameAr: "غرفة إيليت",
    category: "غرف نوم",
    price: 15000,
    description:
      "غرفة نوم بتصميم عصري يجمع بين الأناقة والمتانة، تم تنفيذها بعناية لتوفير أعلى مستوى من الجودة والراحة.",
    materials: [
      "خشب زان احمر",
      "مفصلات سوفت كلوز",
      "مشطيب مقاوم للخدش والرطوبة",
      "اكسسواات متينة لضمان العمر اطول",
    ],
    images: [
      
      "/pics/22-eli/22.1.jpeg",
      "/pics/22-eli/22.2.jpeg",
      "/pics/22-eli/22.3.jpeg",
    ],
    badge: "جديد",
    inStock: true,
    details: [{ label: "العناصر", value: "دولاب, كومود, سرير دبل" }],
  },

];

export default MOCK_PRODUCTS;
